a/an
abandon
abdomen
abide
ability
able
abnormal
aboard
abolish
abound
about
above
abroad
abrupt
absence
absent
absolute
absorb
abstract
absurd
abundant
abuse
academic
academy
accelerate
accent
accept
acceptance
access
accessory
accident
acclaim
accommodate
accommodation(s)
accompany
accomplish
accord
accordance
accordingly
according to
account
accountant
accumulate
accuracy
accurate
accuse
accustom
ache
achieve
acid
acknowledge
acquaint
acquaintance
acquire
acquisition
acre
across
act
action
activate
active
activity
actor/actress
actual
acute
adapt
add
addict
addition
additional
address
adequate
adhere
adjacent
adjective
adjust
administrator
admire
admission
admit
adolescent
adopt
adore
adult
advance
advanced
advantage
advent
adventure
adverb
adverse
advertise
advice
advisable
advise
advocate
aerial
aeroplane/airplane
(a)esthetic
affair
affect
affection
affiliate
affirm
affluent
afford
afraid
after
aftermath
afternoon
afterward(s)
again
against
age
agency
agenda
agent
aggravate
aggregate
aggressive
agitate
ago
agony
agree
agreeable
agriculture
ahead
aid
aim
air
air conditioning
aircraft
airline
airport
aisle
alarm
albeit
album
alcohol
alert
algorithm
alien
alienate
align
alike
alive
all
allege
allegiance
alleviate
alliance
allocate
allow
allowance
alloy
ally
almost
alone
along
alongside
aloud
alphabet
already
also
alter
alternate
alternative
although
altitude
altogether
aluminium
always
amateur
amaze
ambassador
ambiguous
ambition
ambitious
ambulance
amend
amiable
amid(st)
among(st)
amount
ample
amplify
amuse
analog(ue)
analogy
analyse/-yze
analysis
analytic(al)
ancestor
anchor
ancient
and
anecdote
angel
anger
angle
angry
anguish
animal
ankle
anniversary
announce
annoy
annual
anonymous
another
answer
ant
antenna
anticipate
antique
anxiety
anxious
any
anybody/anyone
anyhow
anything
anyway
anywhere
apart
apartment
ape
apologise /-ize
apology
appal(l)
apparatus
apparent
appeal
appear
appearance
appendix
appetite
applaud
applause
apple
appliance
applicable
application
apply
appoint
appointment
appraisal
appreciate
approach
appropriate
approval
approve
approximate
April
apt
arbitrary
arch
arch(a)eology
architect
architecture
archive
area
arena
argue
arguement
arise
arithmetic
arm
army
around
arouse
arrange
array
arrest
arrival
arrive
arrogant
arrow
art
artefact / artifact
artery
article
articulate
artificial
artist
artistic
as
ascend
ascertain
ascribe
ash
ashamed
ashore
aside
ask
asleep
aspect
aspire
assassinate
assault
assemble
assembly
assert
assess
assert
assign
assignment
assimilate
assist
assistance
associate
association
assume
assumption
assurance
assuranceastonish
astronaut
astronomy
at
athlete
atmosphere
atom
attach
attack
attain
attempt
attend
attendant
attention
attitude
attorney
attract
attractive
attribute
acution
audience
audio
audit
auditorium
augment
Augest
aunt
aural
authrntic
author
authority
automatic
automation
automobile / auto
autonomy
autumn / fall
auxiliary
available
avenue
average
avert
aviation
avoid
await
awake
award
aware
awe
awful
awkward
ax(e)
axis